{
  "courses": [
    {
      "category": "Computer Science (CSCI)",
      "code": "CSCI 2824",
      "title": "Discrete Structures",
      "description": "Covers foundational materials for computer science that is often assumed in advanced courses. Topics include set theory, Boolean algebra, functions and relations, graphs, propositional and predicate calculus, proofs, mathematical induction, recurrence relations, combinatorics, discrete probability. Focuses on examples based on diverse applications of computer science. Same as CSPB 2824.",
      "sections": [
        {
          "classNumber": "25257",
          "section": "001",
          "type": "LEC",
          "days": "MWF",
          "time": "9:10a-10:00a",
          "instructor": "R. Tutmaher",
          "status": "Open"
        },
        {
          "classNumber": "27508",
          "section": "003",
          "type": "LEC",
          "days": "MWF",
          "time": "11:30a-12:20p",
          "instructor": "M. Cox",
          "status": "Full"
        }
      ]
    },
    {
      "category": "Computer Science (CSCI)",
      "code": "CSCI 3022",
      "title": "Introduction to Data Science with Probability and Statistics",
      "description": "Introduces students to the tools methods and theory behind extracting insights from data. Covers algorithms of cleaning and munging data, probability theory and common distributions, statistical simulation, drawing inferences from data, and basic statistical modeling. Same as CSPB 3022.",
      "sections": [
        {
          "classNumber": "27477",
          "section": "001",
          "type": "LEC",
          "days": "MWF",
          "time": "1:50p-2:40p",
          "instructor": "",
          "status": "Open"
        },
        {
          "classNumber": "27649",
          "section": "001",
          "type": "LEC",
          "days": "MWF",
          "time": "4:10p-5:00p",
          "instructor": "M. Cox",
          "status": "Open"
        }
      ]
    },
    {
      "category": "Computer Science (CSCI)",
      "code": "CSCI 3104",
      "title": "Algorithms",
      "description": "Covers the fundamentals of algorithms and various algorithmic strategies, including time and space complexity, sorting algorithms, recurrence relations, divide and conquer algorithms, greedy algorithms, dynamic programming, linear programming, graph algorithms, problems in P and NP, and approximation algorithms. Same as CSPB 3104.",
      "sections": [
        {
          "classNumber": "39692",
          "section": "100",
          "type": "LEC",
          "days": "TR",
          "time": "9:35a-10:50a",
          "instructor": "B. Waggoner",
          "status": "Full"
        },
        {
          "classNumber": "27509",
          "section": "110",
          "type": "LEC",
          "days": "TR",
          "time": "9:35a-10:50a",
          "instructor": "B. Waggoner",
          "status": "Full"
        },
        {
          "classNumber": "25342",
          "section": "200",
          "type": "LEC",
          "days": "TR",
          "time": "2:20p-3:35p",
          "instructor": "J. Grochow",
          "status": "Full"
        }
      ]
    },
    {
      "category": "Computer Science (CSCI)",
      "code": "CSCI 4413",
      "title": "Computer Security and Ethical Hacking",
      "description": "Teaches basic exploit design and development through hands-on experimentation and testing. Uses a controlled environment to give students a 'playground' in which to test penetration skills that are normally not allowed on live networks. Same as CSCI 5413.",
      "sections": [
        {
          "classNumber": "28260",
          "section": "001",
          "type": "LEC",
          "days": "TR",
          "time": "8:00a-9:15a",
          "instructor": "J. Black",
          "status": "Open"
        }
      ]
    },
    {
      "category": "Data Science (DTSC)",
      "code": "DTSC 5301",
      "title": "Data Science as a Field",
      "description": "This course provides a general introduction to the field of Data Science. It has been designed for aspiring data scientists, content experts who work with data scientists, or anyone interested in learning about what Data Science is and what it’s used for. Weekly topics include the past, present, and future of the field; examination of the process and pitfalls of data science; the academic disciplines that both practice and make use of Data Science; collaboration between data scientists and content experts; and the practice of Data Science in the professional world. This course is part of CU Boulder’s Master’s of Science in Data Science and was collaboratively designed by both academics and industry professionals to provide learners with an insider’s perspective on this exciting, evolving, and increasingly vital discipline.",
      "sections": [
        {
          "classNumber": "35058",
          "section": "001",
          "type": "LEC",
          "days": "TR",
          "time": "9:35a-10:50a",
          "instructor": "D. Wall",
          "status": "Open"
        }
      ]
    },
    {
      "category": "Data Science (DTSC)",
      "code": "DTSC 5302",
      "title": "Ethical Issues in Data Science",
      "description": "This course examines ethical issues related to data science, with the objective of making data science professionals aware of and sensitive to ethical considerations that may arise in their careers. It focuses on ethical frameworks, data science applications that lead to ethical considerations, professional ethics, current media and scholarly articles, and the perspectives and experiences of fellow students and computing professionals.",
      "sections": [
        {
          "classNumber": "35060",
          "section": "001",
          "type": "LEC",
          "days": "TR",
          "time": "9:35a-10:50a",
          "instructor": "R. Schnabel",
          "location": "Muenzinger Psyc & Biopsych E431",
          "status": "Open"
        }
      ]
    },
    {
      "category": "Data Science (DTSC)",
      "code": "DTSC 5303",
      "title": "Cybersecurity for Data Science",
      "description": "This course aims to help anyone interested in data science understand the cybersecurity risks and the tools/techniques that can be used to mitigate those risks. We will cover the distinctions between confidentiality, integrity, and availability, introduce learners to relevant cybersecurity tools and techniques including cryptographic tools, software resources, and policies that will be essential to data science. We will explore key tools and techniques for authentication and access control so producers, curators, and users of data can help ensure the security and privacy of the data.",
      "sections": [
        {
          "classNumber": "35061",
          "section": "001",
          "type": "LEC",
          "days": "TR",
          "time": "9:35a-10:50a",
          "instructor": "",
          "location": "Muenzinger Psyc & Biopsych E431",
          "status": "Open"
        }
      ]
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Bret Graham",
      "username": "BretG",
      "email": "bret.graham@april.biz"
    },
    {
      "id": 2,
      "name": "Antonette Howell",
      "username": "AHowell",
      "email": "ahowell@melissa.tv"
    },
    {
      "id": 3,
      "name": "Clementine Bauch",
      "username": "CB",
      "email": "clementine@yesenia.net"
    },
    {
      "id": 4,
      "name": "Patricia Lebsack",
      "username": "Pat",
      "email": "patricia.lebsack@kory.org"
    },
    {
      "id": 5,
      "name": "Chelsey Dietrich",
      "username": "Dietrich",
      "email": "chelsey_dietrich@annie.ca"
    }
  ]
}